Repository: pepr/progit2-cs
Catalog: omegat/ScottChacon_ProGit2-omegat.tmx
Source language: en
Languages: cs

source: In such cases, you can create a file listing patterns to match them named `.gitignore`.(((ignoring files))) Here is an example `.gitignore` file:
cs: V takových případech můžete vytvořit soubor `.gitignore` se seznamem masek pro ignorované soubory.(((ignorované soubory))) Zde je příklad souboru `.gitignore`:

source: In that case, the `git am` process will fail and ask you what you want to do:
cs: V takovém případě proces `git am` neproběhne a Git se vás zeptá, co chcete udělat dál:

source: In that case, you start the command with a `!` character.
cs: V takovém případě zadejte na začátek příkazu znak `!`.

source: In the Git source code, for example, the maintainer has added their GPG public key as a blob object and then tagged it.
cs: Ve zdrojovém kódu systému Git správce například vložil svůj veřejný klíč GPG jako objekt blobu a ten označil značkou.

source: In the current project, this directory contains no files, but it does contain a simple structure:
cs: V aktuálním projektu nejsou v tomto adresáři žádné soubory, zatím tu najdete jen jednoduchou strukturu:

source: In the default case that is automatically written by a `git remote add` command, Git fetches all the references under `refs/heads/` on the server and writes them to `refs/remotes/origin/` locally.
cs: Ve výchozím případě, který se automaticky zapisuje příkazem `git remote add`, Git vyzvedne všechny reference z adresáře `refs/heads/` na serveru a zapíše je do lokálního adresáře `refs/remotes/origin/`.

source: In the early days of Git (mostly pre 1.5), the user interface was much more complex because it emphasized this filesystem rather than a polished VCS.
cs: V dávných dobách (zhruba do verze 1.5) bývalo uživatelské rozhraní systému Git podstatně složitější než dnes. Git tehdy spíš než na uhlazené VCS kladl důraz právě na systém souborů.

source: In the following examples, and throughout most of this book, for the sake of brevity this book doesn't have nicely-formatted messages like this; instead, we use the `-m` option to `git commit`.
cs: V následujících příkladech -- a ve většině ukázek v knize -- se takto pěkně naformátované zprávy nepoužívají kvůli stručnosti. Místo toho budeme používat volbu `-m` za příkazem `git commit`.

source: In the last example output, the unstaged area looks like this:
cs: U posledního příkladu vypadá oblast připravených změn takto:

source: In the meantime, Jessica has been working on a topic branch.
cs: Jessica mezitím pracovala na tématické větvi.

source: In the next chapter, you'll learn about how to use the largest and most popular Git hosting service, GitHub.
cs: V další kapitole se naučíte, jak se používá největší a nejpopulárnějí služba pro hostování Gitu, známá jako GitHub.

source: In the next section, you'll learn about a few common patterns for contributing to a project.
cs: V následující podkapitole se dozvíte o několika obvyklých způsobech přispívání do projektu.

source: In the simplest terms, a bare repository is the contents of your project's `.git` directory and nothing else.
cs: Když to zjednodušíme, holý repozitář je obsah adresáře `.git` vašeho projektu a nic víc.

source: In this case, Git does a simple three-way merge, using the two snapshots pointed to by the branch tips and the common ancestor of the two.
cs: Git v tomto případě provádí jednoduché třícestné sloučení, při kterém používá dva snímky, na které ukazují vrcholy větví, a jejich společného předka.

source: In this case, Git uses the last value for each unique key it sees.
cs: V takovém případě Git použije poslední hodnotu pro každý unikátní klíč, který vidí.

source: In this case, let's say that the last time you ran `git status`, you saw that everything was staged, so you're ready to commit your changes.(((git commands, status))) The simplest way to commit is to type `git commit`:(((git commands, commit)))
cs: V tomto případě jste viděli (dejme tomu, když jste naposledy spustili `git status`), že vše bylo připraveno k zapsání, takže jste připraveni k samotnému zápisu.(((git příkazy, status))) Nejjednodušší způsob spočívá v provedení `git commit`:(((git příkazy, commit)))

source: In this case, the company is using a type of integration-manager workflow where the work of the individual groups is integrated only by certain engineers, and the `master` branch of the main repo can be updated only by those engineers.
cs: Společnost v tomto případě používá typ pracovního postupu s integračním manažerem, kdy práci jednotlivých skupin integrují pouze někteří inženýři a větev `master` hlavního repozitáře mohou aktualizovat pouze oni.

source: In this case, two stashes were done previously, so you have access to three different stashed works.
cs: V tomto případě byly už dříve provedeny dva další odklady, a máte tak k dispozici tři různé odklady.

source: In this case, you already know what file it is.
cs: V tomto případě víte, o jaký soubor se jedná.

source: In this case, you can read an existing tree into your staging area as a subtree by using the `--prefix` option to `read-tree`:
cs: V tomto případě můžete načíst existující strom jako podstrom do oblasti připravených změn pomocí parametru `--prefix`, který zadáte k příkazu `read-tree`:

source: In this case, you can try to rebase that branch on top of `origin/master`, resolve the conflicts for the maintainer, and then resubmit your changes:
cs: V takovém případě můžete zkusit přeskládat tuto větev na vrchol větve `origin/master`, vyřešit za správce vzniklé konflikty a poté své změny ještě jednou odeslat:

source: In this case, you had a clean working directory when you tried to apply the stash, and you tried to apply it on the same branch you saved it from; but having a clean working directory and applying it on the same branch aren’t necessary to successfully apply a stash.
cs: V tomto případě jste měli čistý pracovní adresář, když jste se pokusili odklad aplikovat. Pokusili jste se ho aplikovat na stejnou větev, z níž jste ho uložili. K úspěšnému odkladu však není nezbytně nutné, aby byl pracovní adresář čistý ani abyste ho aplikovali na stejnou větev.

source: In this case, you have a couple of administrators, some documentation writers with access to the `doc` directory, and one developer who only has access to the `lib` and `tests` directories, and your ACL file looks like this:
cs: V našem příkladu máte několik správců, několik tvůrců dokumentace s přístupem do adresáře `doc` a jednoho vývojáře, který má jako jediný přístup do adresářů `lib` a `tests`. Soubor ACL proto bude vypadat následovně:

source: In this case, you remove a file called passwords.txt from every snapshot, whether it exists or not.
cs: V tomto případě odstraníte soubor s názvem passwords.txt ze všech snímků, ať v nich existuje, nebo neexistuje.

source: In this case, you'd do your work in a branch and then rebase your work onto `origin/master` when you were ready to submit your patches to the main project.
cs: V takovém případě budete pracovat ve své větvi, a až budete mít připraveny záplaty k odeslání do hlavního projektu, přeskládáte svou práci na větev `origin/master`.

source: In this case, you're still on `master`.
cs: V tomto případě jsme stále na větvi `master`.

source: In this case, your development history has diverged from some older point.
cs: V tomto případě se historie vývoje od určitého bodu v minulosti rozbíhala.

source: In this chapter, you'll see how to work with Git in a distributed environment as a contributor and an integrator.
cs: V této kapitole uvidíte, jak se v distribuovaném prostředí s Gitem pracuje v roli přispěvatele a v roli integrátora.

source: In this environment, you can follow a workflow similar to what you might do when using Subversion or another centralized system.
cs: V takovém prostředí můžete uplatnit podobný pracovní postup, na jaký jste možná zvyklí ze systému Subversion nebo z jiného centralizovaného systému.

source: In this example, you'd run the following:
cs: U tohoto příkladu byste provedli následující:

source: In this scenario, all work is done in team-based branches and pulled together by the integrators later.
cs: V tomto scénáři se veškerá práce provádí ve větvích jednotlivých týmů a později je spojována integrátory.

source: In this scenario, you have a `master` branch that contains basically stable code.
cs: V tomto scénáři obsahuje vaše větev `master` převážně jen stabilní kód.

source: In this scenario, you have two long-running branches, `master` and `develop`, in which you determine that `master` is updated only when a very stable release is cut and all new code is integrated into the `develop` branch.
cs: V tomto scénáři máte dvě dlouhodobé větve, hlavní větev `master` a větev `develop`. Určíte, že větev `master` bude aktualizována, pouze když je k dispozici velmi stabilní verze a do větve `develop` je integrován veškerý nový kód.

source: In this section you'll learn what rebasing is, how to do it, why it's a pretty amazing tool, and in what cases you won't want to use it.
cs: V této podkapitole se dozvíte, co to přeskládání je, jak se provádí, proč je to docela úžasný nástroj a v jakých případech ho raději nepoužívat.

source: In this section, we'll cover some common workflows that this lightweight branching makes possible, so you can decide if you would like to incorporate it into your own development cycle.
cs: V této části se podíváme na některé běžné pracovní postupy, které vám snadné větvení umožňuje, takže se budete moci rozhodnout, zda je nezařadíte do vývojového cyklu svých projektů.

source: In this section, we'll cover some of these remote-management skills.
cs: V této podkapitole se budeme zabývat některými z těchto dovedností.

source: In this section, you'll learn how to list the available tags, how to create new tags, and what the different types of tags are.
cs: V této části vysvětlíme, jak pořídíte výpis všech dostupných značek, jak lze vytvářet značky nové a jaké typy značek se vám nabízejí.

source: In this section, you’ll cover how to accomplish these very useful tasks so that you can make your commit history look the way you want before you share it with others.
cs: V této části se dozvíte, jak se tyto velmi užitečné úkony provádějí, abyste mohli svou historii revizí před zveřejněním upravit podle svých představ.

source: Instead of
cs: Místo

source: Instead of ``I added tests for'' or ``Adding tests for,'' use ``Add tests for.'' Here is a template originally written by Tim Pope:
cs: Místo „Přidal jsem testy pro“ nebo „Přidány testy pro“ použijte „Přidej testy pro“. Zde je originální (přeložená) šablona, kterou napsal Tim Pope:

source: Instead of an example of Git hosting, I have decided to turn that part of the book into more deeply describing what GitHub is and how to effectively use it.
cs: Rozhodl jsem se, že místo příkladu použití hostovaného systému Git, změním tuto část knihy v podrobnější popis toho, co GitHub je a jak jej efektivně používat.

source: Instead of commits that look like this
cs: Revize už nebudou mít tuto podobu:

source: Instead of just moving the branch pointer forward, Git creates a new snapshot that results from this three-way merge and automatically creates a new commit that points to it.
cs: Git místo pouhého přesunutí ukazatele větve vpřed, tentokrát vytvoří nový snímek, který je výsledkem třícestného slučování, a automaticky vytvoří nový objekt revize, který jej zachycuje.

source: Instead of reading from stdin, this script takes three arguments: the name of the reference (branch), the SHA-1 that reference pointed to before the push, and the SHA-1 the user is trying to push.
cs: Tento skript nenačítá data ze standardního vstupu, místo nich používá tři jiné parametry: název reference (větve), hodnotu SHA-1, na niž reference ukazovala před odesláním, a hodnotu SHA-1, kterou se uživatel pokouší odeslat.

source: Instead of writing your own Atom-generating code, you decide to use a library.
cs: Místo abyste psali vlastní zdrojový kód ke kanálům Atom, rozhodnete se použít knihovnu.

source: Instead, Git thinks of its data more like a set of snapshots of a miniature filesystem.
cs: Místo toho Git o datech uvažuje jako o sadě snímků miniaturního systému souborů.

source: Instead, you must run `git diff-tree` with the branch you want to compare to:
cs: V tomto případě je třeba zadat příkaz `git diff-tree` a větev, s níž chcete srovnání provést:

source: Is a lieutenant system in place, and do you have to submit your work to them first?
cs: Jsou součástí systému poručíci a musíte všechnu svou práci odesílat nejprve jim?

source: Is it centralized, with each developer having equal write access to the main codeline?
cs: Probíhá vývoj centralizovaně s tím, že každý vývojář má stejné oprávnění pro zápis do hlavní linie kódu?

source: It adds a section to your `.git/config` file, specifying the name of the remote (`origin`), the URL of the remote repository, and the refspec for fetching:
cs: Přidáte tím novou část do souboru `.git/config`, určíte název vzdáleného serveru (`origin`), URL vzdáleného repozitáře a refspec pro vyzvednutí dat:

source: It adds, removes, and modifies files automatically to make sure your working copy is what the branch looked like on your last commit to it.
cs: Automaticky přidá, odstraní a upraví soubory tak, aby zajistil, že vaše pracovní kopie bude vypadat stejně, jako poslední revize v dané větvi.

source: It allows the project leader (the dictator) to delegate much of the work and collect large subsets of code at multiple points before integrating them.
cs: Umožňuje vedoucímu projektu (diktátorovi) velkou část práce delegovat a poté na více místech sesbírat velké podmnožiny kódu, které pak dává dohromady.

source: It allows you to revert files back to a previous state, revert the entire project back to a previous state, compare changes over time, see who last modified something that might be causing a problem, who introduced an issue and when, and more.
cs: Umožní vám vrátit soubory zpět do předchozího stavu, vrátit celý projekt do předchozího stavu, porovnávat změny provedené v průběhu času, zjistit, kdo naposledy upravil něco, co nyní možná způsobuje problémy, kdo a kdy vytvořil diskutabilní část a mnoho dalšího.

source: It also lists all the remote references it has pulled down.
cs: Součástí výpisu jsou také všechny vzdálené reference, které příkaz stáhl.

source: It also puts a summary of the information at the end.
cs: Na konci výpisu se zároveň objeví souhrn těchto informací.

source: It also shows you which remote branches on the server you don't yet have, which remote branches you have that have been removed from the server, and multiple branches that are automatically merged when you run `git pull`.
cs: Příkaz vám také ukáže, které vzdálené větve na serveru ještě nemáte, které vzdálené větve máte, ale ze serveru už byly odstraněny, a několik větví, které budou automaticky začleněny (merge), když spustíte příkaz `git pull`.

source: It also still looks for `/etc/gitconfig`, although it's relative to the MSys root, which is wherever you decide to install Git on your Windows system when you run the installer.
cs: I ve Windows se hledá soubor `/etc/gitconfig`, který je ale umístěn relativně vůči kořenovému adresáři MSys, tedy vůči místu, do kterého jste se po spuštění instalačního programu rozhodli Git nainstalovat.

source: It also works well with Powershell, and sets up solid credential caching and sane CRLF settings.(((Powershell)))(((CRLF)))(((credential caching))) We'll learn more about those things a little later, but suffice it to say they're things you want.
cs: Dobře funguje i s PowerShell. Instalátor řádně nastaví mezipaměť pro identifikační údaje a použije rozumné nastavení CRLF.(((Powershell)))(((CRLF)))(((uložení identifikačních údajů))) Více si o tom řekneme o něco později, ale mělo by vám stačit, že to jsou věci, které chcete.

source: It does this so you don't accidentally begin including generated binary files or other files that you did not mean to include.
cs: Díky tomu se nemůže stát, že budou do revizí nedopatřením zahrnuty vygenerované binární soubory nebo jiné soubory, které si nepřejete zahrnout.

source: It essentially rewinds the work you've done in your `testing` branch so you can go in a different direction.
cs: V podstatě vrátíte změny, které jste provedli ve větvi `testing`, takže se můžete vydat jiným směrem.

source: It has paused the process while you resolve the conflict.
cs: Prozatím pozastavil celý proces do doby, než konflikt vyřešíte.

source: It is easy to forget which directory you're in and accidentally write to the wrong file or copy over files you don't mean to.
cs: Člověk snadno zapomene, v kterém adresáři se právě nachází, a nedopatřením začne zapisovat do nesprávného souboru, nebo kopírováním přepíše soubory, které přepsat nechtěl.

source: It is hard to get the system to do anything that is not undoable or to make it erase data in any way.
cs: Přimět systém, aby udělal něco, co nelze vzít zpět, nebo aby smazal jakákoli data, je velice obtížné.

source: It keeps a special pointer called `HEAD`.
cs: Používá speciální ukazatel zvaný `HEAD`.

source: It lets you edit the default message before the commit author sees it.
cs: Umožňuje upravit výchozí zprávu dřív, než se zobrazí autorovi revize.

source: It lists the URL for the remote repository as well as the tracking branch information.
cs: Bude obsahovat adresu URL vzdáleného repozitáře a informace o sledovaných větvích.

source: It lists the changes you’ve staged on the left and unstaged changes on the right.
cs: Tento příkaz vypíše všechny změny, které jste připravili k zapsání, na levé straně, nepřipravené změny na pravé.

source: It lists the oldest at the top, rather than the newest, because that’s the first one it will replay.
cs: Seznam uvádí nejstarší revizi nahoře z toho důvodu, že to bude první revize, kterou příkaz přehraje.

source: It looks like the bottom commit is the one you lost, so you can recover it by creating a new branch at that commit.
cs: Zdá se, že revize úplně dole je hledanou ztracenou revizí. Můžete ji obnovit tak, že na ní vytvoříte novou větev.

source: It looks something like this:
cs: Vypadá například takto:

source: It makes Git reconsider almost every aspect of version control that most other systems copied from the previous generation.
cs: Git díky tomu znovu zkoumá skoro každý aspekt správy verzí, který většina ostatních systémů okopírovala z předchozí generace.

source: It may be easier to remember the `~3` because you’re trying to edit the last three commits; but keep in mind that you’re actually designating four commits ago, the parent of the last commit you want to edit:
cs: Snazší k zapamatování je varianta s výrazem `~3`, neboť se pokoušíte upravit poslední tři revize. Nezapomeňte ale, že tím ve skutečnosti označujete čtvrtou revizi od konce, tedy rodiče poslední revize, kterou chcete upravit:

source: It may be helpful to think of it more as ``add this content to the next commit'' rather than ``add this file to the project''.(((git commands, add))) Let's run `git add` now to stage the ``CONTRIBUTING.md'' file, and then run `git status` again:
cs: Možná vám pomůže, když o něm budete uvažovat spíše ve smyslu „přidej tento obsah do dalšího snímku“ než ve smyslu „přidej tento soubor do projektu“.(((git příkazy, add))) Spusťme nyní příkaz `git add`, abychom soubor `CONTRIBUTING.md` připravili k zapsání, a potom znovu zadejme příkaz `git status`:

source: It means that at the core of Git is a simple key-value data store.
cs: Znamená to, že v jádru systému Git se nachází jednoduché úložiště dat, ke kterému lze přistupovat pomocí klíčů.

source: It moved the HEAD pointer back to point to the `master` branch, and it reverted the files in your working directory back to the snapshot that `master` points to.
cs: Přemístil ukazatel `HEAD` zpět, takže nyní ukazuje na větev `master`, a vrátil soubory ve vašem pracovním adresáři zpět ke snímku, na který ukazuje větev `master`.

source: It often happens that while working on one project, you need to use another project from within it.
cs: Často se stává, že pracujete na jednom projektu, ale na chvíli si potřebujete odskočit do jiného.

source: It performs a three-way merge between the two latest branch snapshots (`C3` and `C4`) and the most recent common ancestor of the two (`C2`), creating a new snapshot (and commit).
cs: Ten provede třícestné sloučení mezi dvěma posledními snímky (C3 a C4) a jejich nejmladším společným předkem (C2), přičemž vytvoří nový snímek (a novou revizi).

source: It records the snapshots and then tries to figure out what was renamed implicitly, after the fact.
cs: Zaznamenává snímky a poté se snaží zjistit, co bylo později implicitně přejmenováno.

source: It should be fairly straightforward to determine which solution or combination of solutions is appropriate for you and your organization.
cs: Teď už byste se měli umět rozhodnout, které řešení nebo jaká kombinace řešení se pro vás a pro vaši organizaci hodí.

source: It shows you a list of your staged files, and you can select the ones for which you would like to see the staged diff.
cs: Příkaz zobrazí seznam připravených souborů. Můžete vybrat ty soubory, pro něž chcete zobrazit rozdíly připravených změn.

source: It shows you that a couple of lines are staged and a couple are unstaged.
cs: Oznamuje vám, že několik řádků je připravených k zapsání a několik není.

source: It shows you what commit was the last to modify each line of any file.
cs: Ukáže vám, při které revizi byly jednotlivé řádky každého souboru naposledy změněny.

source: It summarizes all the commits in the range you give it; for example, the following gives you a summary of all the commits since your last release, if your last release was named v1.0.1:
cs: Příkaz shrne všechny revize v zadaném rozmezí. Například následující příkaz zobrazí shrnutí všech revizí od posledního vydání (pokud bylo vaše poslední vydání pojmenováno v1.0.1):

source: It takes a list of references that are being pushed from stdin; if it exits non-zero, none of them are accepted.
cs: Skript používá seznam referencí, které jsou odesílány ze standardního vstupu stdin. Je-li návratová hodnota nenulová, nebude ani jedna z nich přijata.

source: It takes a single argument: the name of the temporary file that contains the proposed commit message.
cs: Používá jediný parametr: název dočasného souboru s požadovaným tvarem zprávy k revizi.

source: It takes the Git repository by itself, without a working directory, and creates a directory specifically for it alone.
cs: Oba vezmou samotný repozitář Git (bez pracovního adresáře) a vytvoří pro něj samostatný adresář.

source: It takes the same stdin data as the `pre-receive` hook.
cs: Používá stejná data ze standardního vstupu jako zásuvný modul `pre-receive`.

source: It tells you pretty explicitly how to discard the changes you've made.
cs: Git přímo říká, jak se dají vámi provedené změny zrušit.

source: It tells you the SHA-1 of the first bad commit and show some of the commit information and which files were modified in that commit so you can figure out what happened that may have introduced this bug:
cs: Sdělí vám SHA-1 první revize s chybou a zobrazí některé další informace o revizi a o tom, které soubory byly v této revizi změněny. Zjistíte tak, co bylo součástí revize a co může způsobovat hledanou chybu:

source: It tries to run a command on the remote server via an SSH call that looks something like this:
cs: Na vzdáleném serveru se pokusí spustit příkaz prostřednictvím volání SSH:

source: It turns out that Git stages a file exactly as it is when you run the `git add` command.
cs: Věc se má tak, že Git po spuštění příkazu `git add` připraví soubor k zapsání přesně ve tvaru, v jakém se nachází v daném okamžiku.
